[
    {
        "title": "Google Paid Apple $20 Billion in 2022 to Be Default Safari Search Engine",
        "description": "Google paid Apple $20 billion in 2022 to be the default search engine for Safari on iPhone, iPad, and Mac, reports Bloomberg. The information was...",
        "publishedAt": "2024-05-01T23:57:50Z",
        "query": "APPLE"
    },
    {
        "title": "Everything New in the iOS 17.5 Beta",
        "description": "Apple is currently testing iOS 17.5, the fifth major update to the iOS 17 operating system that came out last September. Like iOS 17.4, iOS 17.5...",
        "publishedAt": "2024-05-01T23:27:59Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Watch Ultra 3 will be a boring update, top insider suggests",
        "description": "While we expect great changes for the Apple Watch Series 10, it seems the new Apple Watch Ultra 3 will be a boring update. Here's why.",
        "publishedAt": "2024-05-01T16:13:33Z",
        "query": "APPLE"
    },
    {
        "title": "iOS 18 Calendar app update could finally make it useful on iPhone",
        "description": "Ahead of the official iOS 18 announcement on June 10, a report says Apple will solve Calendar and Reminders apps' main issue.",
        "publishedAt": "2024-05-01T14:29:25Z",
        "query": "APPLE"
    },
    {
        "title": "Kuo: Apple Watch Ultra to Get 'Almost No' Hardware Upgrades This Year",
        "description": "Just over six months ago, Apple supply chain analyst Ming-Chi Kuo said the likelihood of a new Apple Watch Ultra being released in 2024 was...",
        "publishedAt": "2024-05-01T13:53:24Z",
        "query": "APPLE"
    },
    {
        "title": "How to rename your Apple devices so you can tell them apart",
        "description": "You can change the name of your Apple devices, whether you have an iPhone, iPad, Apple Watch, Mac or AirPods.",
        "publishedAt": "2024-05-01T13:00:41Z",
        "query": "APPLE"
    },
    {
        "title": "TikTok is bypassing the Apple App Store fee",
        "description": "No app developer likes paying 30% of their in-app purchase revenue to app stores, and this issue has come up countless times over the years. Famously,",
        "publishedAt": "2024-05-01T12:52:49Z",
        "query": "APPLE"
    },
    {
        "title": "iPhone 15 might get a new color variant at iPad event next week",
        "description": "Less than a week from now, Apple will hold its Let Loose event. It's possible that Cupertino will unveil a new iPhone 15 color.",
        "publishedAt": "2024-05-01T12:36:03Z",
        "query": "APPLE"
    },
    {
        "title": "The Morning After: Our verdict on the Beats Solo 4 headphones",
        "description": "The biggest news stories this morning:\nWhat to expect from Apple’s Let Loose iPad event, The excellent and customizable Arc Browser is now fully available on Windows, Binance founder Changpeng Zhao sentenced to four months in prison",
        "publishedAt": "2024-05-01T12:10:00Z",
        "query": "APPLE"
    },
    {
        "title": "Report Examines GM's Controversial Move to Abandon Apple CarPlay",
        "description": "An in-depth Bloomberg report today resurfaced General Motors' decision to replace Apple CarPlay with its own software. Last year, GM announced...",
        "publishedAt": "2024-05-01T11:53:08Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Vision Pro Launch Was A Success With Other Companies, As CEO Tim Cook Shares That Half Of Fortune 100 Companies Have Purchased The AR Headset",
        "description": "The Apple Vision Pro demand may have reduced substantially, but the company’s earnings call revealed that it is a hit among other companies",
        "publishedAt": "2024-05-02T22:59:21Z",
        "query": "APPLE"
    },
    {
        "title": "Apple's Q2 2024 Earnings Call Takeaways",
        "description": "Apple today held its earnings call for the second fiscal quarter of 2024 (first calendar quarter), with Apple CEO Tim Cook and Apple CFO Luca Maestri...",
        "publishedAt": "2024-05-02T22:05:16Z",
        "query": "APPLE"
    },
    {
        "title": "Apple can't tell you iPhone sales are booming, so it's talking about 'services.' That's a problem.",
        "description": "Apple's Tim Cook wants Wall Street to focus on its service business, but that business is under threat.",
        "publishedAt": "2024-05-02T21:36:32Z",
        "query": "APPLE"
    },
    {
        "title": "Reason Behind Apple and Samsung's Cautious Approach to Fast Charging",
        "description": "Apple and Samsung fast charging pattern is conservative. Dive deep into their thoughtful considerations and long-term benefits for users",
        "publishedAt": "2024-05-02T21:14:22Z",
        "query": "APPLE"
    },
    {
        "title": "Apple earnings see 10% iPhone sales drop, massive buyback fuels stock jump",
        "description": "Apple on Thursday reported a 10% drop in iPhone sales for the second fiscal quarter, dropping from $51.33 billion to $45.96 billion, year-over-year. The",
        "publishedAt": "2024-05-02T20:45:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple's largest-ever $110 billion stock buyback has investors jacked",
        "description": "The tech giant's board approved share repurchases worth $110 billion",
        "publishedAt": "2024-05-02T20:45:00Z",
        "query": "APPLE"
    },
    {
        "title": "Stock Market News Today: Markets end solidly higher ahead of Apple results (SP500)",
        "description": "Wall Street ended solidly higher on Thursday, propped up by technology stocks on the back of a rise in chip names.",
        "publishedAt": "2024-05-02T20:08:38Z",
        "query": "APPLE"
    },
    {
        "title": "iOS 18 Rumored to Add New Features to These 16 Apps on Your iPhone",
        "description": "Apple is expected to announce iOS 18 during its WWDC keynote on June 10, and new features have already been rumored for many apps, including Apple...",
        "publishedAt": "2024-05-02T18:44:15Z",
        "query": "APPLE"
    },
    {
        "title": "Wear OS’s big comeback continues; might hit half of Apple Watch sales",
        "description": "Counterpoint Research projects 27 percent market share this year to Apple's 49.",
        "publishedAt": "2024-05-02T18:06:13Z",
        "query": "APPLE"
    },
    {
        "title": "How to tell if your AirPods are fake. Yes, they are out there",
        "description": "Apple AirPods should bring you years of enjoyment. Unfortunately, counterfeit AirPods exist. Here's how you can tell if yours are legit.",
        "publishedAt": "2024-05-02T18:00:56Z",
        "query": "APPLE"
    },
    {
        "title": "Berkshire's profit plunges 64% on portfolio holdings as Buffett sells Apple",
        "description": "Berkshire Hathaway says its first quarter profit plummeted on the paper value of its investments. At the same time, the company said Saturday that most of the businesses it owns outright did well.",
        "publishedAt": "2024-05-04T22:43:45Z",
        "query": "APPLE"
    },
    {
        "title": "Google I/O 2024 is the company's last shot to dominate mobile AI",
        "description": "Apple won't be kept down in the AI race forever",
        "publishedAt": "2024-05-04T16:00:14Z",
        "query": "APPLE"
    },
    {
        "title": "It's been 30 years since Apple released this boldly innovative product",
        "description": "One Apple device wasn't cheap but it was an absolute hit in its time.",
        "publishedAt": "2024-05-04T13:00:57Z",
        "query": "APPLE"
    },
    {
        "title": "Top Stories: Apple Event Preview, iPad Pro With M4 Chip Rumor, New Beats Headphones, and More",
        "description": "It's been a long time since the last one, but an Apple event is finally right around the corner! While it's anticipated to be a fairly short...",
        "publishedAt": "2024-05-04T13:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "Hurry! Walmart's epic weekend sale is live - 75-inch TV for $448, Apple Watch 9 for $299",
        "description": "Save big on TVs, earbuds and the PlayStation 5 with our deal picks from Walmart.",
        "publishedAt": "2024-05-04T08:30:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple TV+'s Sugar has one of the wildest TV plot twists of all time",
        "description": "I don't think I've ever seen a show throw a plot curveball as truly insane as Sugar, Apple's detective drama starring Colin Farrell.",
        "publishedAt": "2024-05-05T22:43:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Event This Week Expected to Last 'About 35 Minutes'",
        "description": "Apple will be holding its first event of the year this Tuesday, May 7 at 7 a.m. Pacific Time, with a live stream to be available on Apple.com and on...",
        "publishedAt": "2024-05-05T22:13:12Z",
        "query": "APPLE"
    },
    {
        "title": "How to Watch the 'Let Loose' Apple Event on Tuesday, May 7",
        "description": "Apple will hold its first media event of 2024 on Tuesday, May 7, at 7:00 a.m. Pacific Time through a live stream. Titled \"Let Loose,\" the...",
        "publishedAt": "2024-05-05T20:47:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple updates the EU’s core technology fee rules",
        "description": "Explore the exemptions and grace periods within Apple's Core Technology Fee framework and their implications for app creators.",
        "publishedAt": "2024-05-05T20:32:36Z",
        "query": "APPLE"
    },
    {
        "title": "Today in Apple history",
        "description": "On May 5, 2003, just a week after launching the iTunes Music Store, Apple reached an incredible milestone with more than 1 million songs sold.",
        "publishedAt": "2024-05-05T16:54:06Z",
        "query": "APPLE"
    },
    {
        "title": "Apple results, guidance has implications for supply chain: analysts",
        "description": "Apple's (AAPL) quarterly results and guidance are widely seen as a barometer for tech spending, given the enormous size and complexity of its supply chain. Read for more.",
        "publishedAt": "2024-05-05T12:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "LG TVs are getting a free audio upgrade that Apple users will absolutely love",
        "description": "LG has updated its Apple Music app, bringing Dolby Atmos support to its OLED and QNED TVs. Here's why that matters.",
        "publishedAt": "2024-05-05T09:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "Siri has become Apple's Bing. It's time for an AI-inspired change",
        "description": "As Apple promises to venture further into AI, the name Siri -- and the assistant itself -- just doesn't feel right any more. For very good reasons.",
        "publishedAt": "2024-05-05T09:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "iPhone 16 - how Apple can make this year's phone a must-have upgrade",
        "description": "There hasn't been a big wave of iPhone upgrades for several years now. Here's how Apple could convince people that this fall's iPhone 16 models are the ones to grab.",
        "publishedAt": "2024-05-05T07:30:15Z",
        "query": "APPLE"
    },
    {
        "title": "Apple honors 50 students as it expands coding beyond engineers heading into WWDC 2024",
        "description": "Exclusive: ZDNET spoke with winners as well as Apple executive Susan Prescott about this year's Swift Student Challenge.",
        "publishedAt": "2024-05-06T23:49:00Z",
        "query": "APPLE"
    },
    {
        "title": "NYPD academy graduates 576 NYC, MTA cops in latest class",
        "description": "The NYPD academy on Monday graduated 576 new cops on Monday, including 33 who will join the MTA police force -- even as the city's PBA says more cops are still needed to patrol the Big Apple.",
        "publishedAt": "2024-05-06T22:26:17Z",
        "query": "APPLE"
    },
    {
        "title": "Apple TV+'s Severance will return in the 'somewhat near future'",
        "description": "Who else is ready for a new season of Severance on Apple TV+? Star Adam Scott confirms that it's coming in the \"somewhat near future.\"",
        "publishedAt": "2024-05-06T22:17:00Z",
        "query": "APPLE"
    },
    {
        "title": "Lucid loses longtime Apple and Intel exec who steered software division",
        "description": "Lucid Motors' senior vice president of digital Mike Bell, a longtime Apple exec, has resigned from his position at the EV startup.",
        "publishedAt": "2024-05-06T21:03:19Z",
        "query": "APPLE"
    },
    {
        "title": "WATCH: Tiffany Boone Speaks On Highlighting Black Women In The Movement",
        "description": "Starring in Apple TV+’s ‘The Big Cigar,’ the actress explains the important role of women in the Black Panther Party and beyond.",
        "publishedAt": "2024-05-06T20:51:46Z",
        "query": "APPLE"
    },
    {
        "title": "What's new on the gaming service",
        "description": "Apple has revealed what new games are coming to its game subscription service, Apple Arcade, (even on the Vision Pro) in June of 2024.",
        "publishedAt": "2024-05-06T20:19:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple launches 2024 Rainbow Series - includes watch straps, watch faces, and dynamic wallpapers",
        "description": "Empower yourself with the Apple Rainbow Series 2024. Choose from a range of vibrant watch straps watch faces and more",
        "publishedAt": "2024-05-06T19:53:58Z",
        "query": "APPLE"
    },
    {
        "title": "Here's When Apple Will Release iOS 17.5 Update For The iPhone",
        "description": "Apple os hosting its Let Loose event tomorrow, here's when the company will release its major iOS 17.5 update for the iPhone.",
        "publishedAt": "2024-05-06T19:22:08Z",
        "query": "APPLE"
    },
    {
        "title": "iPhone 17 Pro Rumors: 12GB RAM, Narrower Dynamic Island for Pro Max",
        "description": "It's an iPhone 17 rumor frenzy this week courtesy of Jeff Pu, an analyst who has sources within Apple's supply chain in Asia. While the...",
        "publishedAt": "2024-05-06T18:42:41Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Reportedly Building M2 Ultra and M4-Powered AI Servers",
        "description": "Apple has started building its own AI servers that use the M2 Ultra chip, Haitong analyst Jeff Pu reports. Pu provided the analysis based on supply...",
        "publishedAt": "2024-05-06T18:37:55Z",
        "query": "APPLE"
    },
    {
        "title": "‘Dark Matter’ review: Joel Edgerton stars in Blake Crouch’s Apple series with a bad case of multiverse madness",
        "description": "“Dark Matter” takes another plunge into the madness of multiverses, operating on a more cerebral and down-to-earth level than the superhero epics that have explored it.",
        "publishedAt": "2024-05-08T23:48:02Z",
        "query": "APPLE"
    },
    {
        "title": "Instead of getting thinner, the upgrade iPads need is better oleophobic coating",
        "description": "The Apple Pencil is great and all, but it demanded a sacrifice. And we can still feel the loss!",
        "publishedAt": "2024-05-08T22:32:57Z",
        "query": "APPLE"
    },
    {
        "title": "256GB makes sense for the base iPhone 16 Pro",
        "description": "Apple bumped the base storage for the M4 iPad Pro to 256GB, and I think the iPhone 16 Pro should get the same upgrade.",
        "publishedAt": "2024-05-08T20:19:58Z",
        "query": "APPLE"
    },
    {
        "title": "iPad Air Now Heavier Than iPad Pro",
        "description": "Apple's new iPad Pro models are so light that they weigh less than its latest iPad Air devices, which might have some consumers wondering what...",
        "publishedAt": "2024-05-08T19:27:44Z",
        "query": "APPLE"
    },
    {
        "title": "OLED iPad Pro Does Not Feature A Dual Camera Setup At The Back Anymore, As Apple Ditches The Ultra-Wide Lens",
        "description": "Apple launch the new iPad Pro with an OLED display but it is a step down in the camera department as the company removes the ultra-wide lens.",
        "publishedAt": "2024-05-08T19:10:09Z",
        "query": "APPLE"
    },
    {
        "title": "These Are the Best Preorder Deals on the New iPads",
        "description": "The 11th-generation iPad Pro and iPad Air are already listed on the Apple Store, Amazon, Best Buy, and other stores. Here are the best preorder deals available for the May 15 release date.",
        "publishedAt": "2024-05-08T19:00:41Z",
        "query": "APPLE"
    },
    {
        "title": "2024 iPad Pro: Best New Features",
        "description": "Apple finally refreshed the iPad Pro, and the new feature set was worth the wait. From new OLED display technology to the M4 chip, the 2024 iPad Pro...",
        "publishedAt": "2024-05-08T18:43:02Z",
        "query": "APPLE"
    },
    {
        "title": "How to Spoof Google's Circle to Search With an Apple Shortcut",
        "description": "Apple Shortcuts lets you program a similar feature, and you can even assign it a gesture.",
        "publishedAt": "2024-05-08T18:40:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Vision Pro will bring the MCU to new life with Marvel's What If…? - An Immersive Story",
        "description": "Marvel Studios and ILM Immersive announced What If…? – An Immersive Story, an hourlong interactive experience coming soon via app for the Apple Vision Pro.",
        "publishedAt": "2024-05-08T18:27:30Z",
        "query": "APPLE"
    },
    {
        "title": "Buy Nvidia and Apple stock, skip McDonald's and Starbucks, analyst says",
        "description": "Rohan Reddy of Global X ETFs says consumer-dependent stocks like McDonald's and Starbucks should be avoided",
        "publishedAt": "2024-05-08T17:13:00Z",
        "query": "APPLE"
    },
    {
        "title": "The Apple Vision Pro may have tanked - but spatial computing is still the future, Deloitte says",
        "description": "Spatial computing, or the blending of physical and digital worlds, is not just a sci fi pipe dream — it's the next level of interaction.",
        "publishedAt": "2024-05-09T22:42:54Z",
        "query": "APPLE"
    },
    {
        "title": "Apple apologizes for 'crushed' iPad Pro ad after widespread online blowback",
        "description": "Apple is apologizing for its advertisement promoting its latest iPad Pro after widespread blowback online.",
        "publishedAt": "2024-05-09T21:16:48Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Pencil Pro: All the New Features",
        "description": "Apple this week debuted the Apple Pencil Pro, marking the first major revision to the Apple Pencil lineup since the 2018 launch of the Apple Pencil...",
        "publishedAt": "2024-05-09T17:03:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple releases iTunes 12.13.2 update for Windows: Compatible with 2024 iPad Pro/Air",
        "description": "Upgrade your iTunes experience on Windows with the newest update - version 12.13.2. Enjoy improved security measures and more compatibility",
        "publishedAt": "2024-05-09T16:44:48Z",
        "query": "APPLE"
    },
    {
        "title": "Watch: ‘Palm Royale’ star Mindy Cohn",
        "description": "From child star to Apple’s ‘Palm Royale’ ensemble, actor Mindy Cohn sits down with Segun to dish on high society and memories from “The Facts of Life.”",
        "publishedAt": "2024-05-09T16:20:43Z",
        "query": "APPLE"
    },
    {
        "title": "10 Reasons to Wait for Next Year's iPhone 17",
        "description": "Apple's iPhone development roadmap runs several years into the future and the company is continually working with suppliers on several successive...",
        "publishedAt": "2024-05-09T16:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "Could John Ternus equal Tim Cook and Steve Jobs as Apple CEO?",
        "description": "John Ternus, Apple's SVP of hardware engineering, may be the top candidate to take on the role of Apple CEO once held by Steve Jobs.",
        "publishedAt": "2024-05-09T15:30:19Z",
        "query": "APPLE"
    },
    {
        "title": "Apple pulls new iPad ad following backlash and issues apology",
        "description": "Apple's stylish iPad Pro ad seemed innocent enough at first, but it's causing some pretty serious uproar online.",
        "publishedAt": "2024-05-09T14:22:02Z",
        "query": "APPLE"
    },
    {
        "title": "MacBook Pro & Air blowout, $99 Bose speaker, $25 Fire TV Stick 4K, $15 TOZO earbuds, more",
        "description": "Thursday's top daily deals include deep discounts on Apple MacBook laptops, Bose portable speakers, Amazon Fire TV Stick 4K, and more.",
        "publishedAt": "2024-05-09T13:33:00Z",
        "query": "APPLE"
    },
    {
        "title": "First M4 iPad Pro benchmarks show 21% performance increase",
        "description": "Find out how the Apple M4 processor in the 2024 iPad Pro outperforms its predecessor, the M3. The chip is expected to hit Macs this autumn.",
        "publishedAt": "2024-05-09T01:15:29Z",
        "query": "APPLE"
    },
    {
        "title": "Apple nears deal with OpenAI to power upcoming iPhone features with ChatGPT, says Bloomberg",
        "description": "After also talking to Google about AI tech for iOS 18, Apple has closed in on an agreement with OpenAI.",
        "publishedAt": "2024-05-10T22:36:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple's Notes app might get an AI assistant that transcribes audio - everything we know so far",
        "description": "Notes and Voice Memos might get AI integration with transcription abilities to save time and summaries.",
        "publishedAt": "2024-05-10T21:41:02Z",
        "query": "APPLE"
    },
    {
        "title": "This is the dumbest M4 iPad Pro complaint I’ve seen",
        "description": "It will be interesting to see whether Apple addresses always-on support in any way. Or if iPadOS 18 will bring the feature to the iPad Pro.",
        "publishedAt": "2024-05-10T21:17:13Z",
        "query": "APPLE"
    },
    {
        "title": "For real this time? New rumor suggests Apple is again working with Samsung on foldable screens",
        "description": "Apple appears to be moving full steam ahead with foldable devices as rumors pile up.",
        "publishedAt": "2024-05-10T20:00:06Z",
        "query": "APPLE"
    },
    {
        "title": "Apple's Siri is getting an AI reboot to compete with ChatGPT",
        "description": "Apple's realization that ChatGPT is more advanced than its virtual assistant reportedly kickstarted its generative AI efforts",
        "publishedAt": "2024-05-10T19:57:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple using AI to make Siri more useful",
        "description": "A broad outline of Apple's plan to improve the Siri voice assistant with artificial intelligence leaked out Friday.",
        "publishedAt": "2024-05-10T19:45:13Z",
        "query": "APPLE"
    },
    {
        "title": "Apple plans its brightest iPhone display ever",
        "description": "The latest rumors of the iPhone 16 Pro reveal Apple might be planning the brightest display to date on an iPhone.",
        "publishedAt": "2024-05-10T19:12:00Z",
        "query": "APPLE"
    },
    {
        "title": "I've used every iPad since the first one. For the new 2024 models, this is my buying advice",
        "description": "The iPad Pro now packs a ton of upgrades that include Tandem OLED, M4 chips, and Apple Pencil Pro. But who should buy one? And how about the iPad Air?",
        "publishedAt": "2024-05-10T18:30:00Z",
        "query": "APPLE"
    },
    {
        "title": "The MacRumors Show: M4 iPad Pro and M2 iPad Air Are Finally Here!",
        "description": "On this week's special episode of The MacRumors Show, we discuss Apple's newly announced iPad Pro, iPad Air, Apple Pencil Pro, and revamped...",
        "publishedAt": "2024-05-10T16:09:29Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Apologizes for 'Crush' iPad Pro Ad, Won't Put It on TV",
        "description": "When introducing the new M4 iPad Pro models, Apple showed a video of a hydraulic press crushing all manner of creative tools, including musical...",
        "publishedAt": "2024-05-10T15:32:20Z",
        "query": "APPLE"
    },
    {
        "title": "Apple's first unionized store voted to strike",
        "description": "Staff at an Apple Store in Towson, Maryland, authorized a strike on Saturday",
        "publishedAt": "2024-05-12T22:07:02Z",
        "query": "APPLE"
    },
    {
        "title": "Galaxy S25 Ultra chipset to get faster clock speed in redesign",
        "description": "Qualcomm will redesign the Snapdragon 8 Gen 4 after the Apple M4 performs very strongly on Geekbench.",
        "publishedAt": "2024-05-12T21:06:49Z",
        "query": "APPLE"
    },
    {
        "title": "New Apple TV+ Show Marks A Career First For Natalie Portman After 30 Years",
        "description": "After 30 years in Hollywood, the incredibly prolific Academy Award-winning actor Natalie Portman is still having monumental career firsts in 2024.",
        "publishedAt": "2024-05-12T18:30:01Z",
        "query": "APPLE"
    },
    {
        "title": "Bill Gates on iPod: Doom awaits!",
        "description": "On May 12, 2005, Bill Gates said Apple's time on top, thanks to the iPod, was limited due to the arrival of cellphones. He was half right.",
        "publishedAt": "2024-05-12T17:11:59Z",
        "query": "APPLE"
    },
    {
        "title": "Best home automation systems",
        "description": "Google, Amazon, and Apple all offer home automation systems, but there are so many others. Here are the major options, and how they stack up.",
        "publishedAt": "2024-05-12T15:30:58Z",
        "query": "APPLE"
    },
    {
        "title": "Gritty detective series",
        "description": "Colin Farrell's star power and a massive plot twist kept the Apple TV+ detective series \"Sugar\" popular.",
        "publishedAt": "2024-05-12T14:15:59Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Store workers in Maryland vote to authorize strike",
        "description": "Apple Store workers in Towson, Maryland, the first of the tech giant’s retail employees to unionize, made history again by voting late Saturday in favor of authorizing a strike.",
        "publishedAt": "2024-05-12T13:16:03Z",
        "query": "APPLE"
    },
    {
        "title": "How iPadOS Is Dragging The OLED iPad Pro Down To The Level Of The Budget iPads",
        "description": "New OLED iPad Pro models are great, but iPadOS is holding back its potential to become a full-fledged computer and Apple needs to take note.",
        "publishedAt": "2024-05-12T11:56:40Z",
        "query": "APPLE"
    },
    {
        "title": "Snapdragon 8 Gen 4 Rumored To Feature A Chipset Redesign That Will Be Finalized In June, 4.26GHz Is Target Frequency To Take On Apple’s A-Series SoCs",
        "description": "Qualcomm could be tweaking the Snapdragon 8 Gen 4 design, allowing it to run at faster clock speeds to take on Apple’s A-series chipsets",
        "publishedAt": "2024-05-12T08:24:49Z",
        "query": "APPLE"
    },
    {
        "title": "The M4 iPad Pro's true potential will be realized at WWDC, and AI will have a lot to do with it",
        "description": "Apple's challenge will be aligning breakthrough hardware, like the AI-powered M4 chip, with cutting-edge software.",
        "publishedAt": "2024-05-12T07:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple iOS 17.5 now has alerts for unwanted trackers",
        "description": "Apple is finally adding alerts for “unwanted trackers”. The new feature is part of the iOS 17.5 for the iPhone. The iPhone maker appears to have",
        "publishedAt": "2024-05-13T22:55:05Z",
        "query": "APPLE"
    },
    {
        "title": "Apple iOS 17.5 has alerts for “unwanted trackers” before Android",
        "description": "Apple is finally adding alerts for “unwanted trackers”. The new feature is part of the iOS 17.5 for the iPhone. The iPhone maker appears to have",
        "publishedAt": "2024-05-13T22:55:05Z",
        "query": "APPLE"
    },
    {
        "title": "iPad Marketing VP: iPad and Mac are Complementary Devices, Not Competing Devices",
        "description": "For her review of the new M4 iPad Pro, The Wall Street Journal's Joanna Stern spoke with Tom Boger, Apple's vice president of iPad and Mac...",
        "publishedAt": "2024-05-13T22:53:07Z",
        "query": "APPLE"
    },
    {
        "title": "HDR Bug Impacts OLED iPad Pro, Apple Working on Software Fix",
        "description": "Some new OLED iPad Pro models appear to have an issue with HDR content in select shades of blue, according to a review from iMore. The site found...",
        "publishedAt": "2024-05-13T22:40:35Z",
        "query": "APPLE"
    },
    {
        "title": "iPhone And Android Finally Get Anti-Stalking Alerts For Most Bluetooth Trackers",
        "description": "While helpful, Bluetooth like Apple AirTags can also put you in a dangerous situation. For this reason, iPhone and Android are getting anti-stalking alerts.",
        "publishedAt": "2024-05-13T22:36:16Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Could Likely Lose Against Epic Games in Court Battle, As US Judge Criticized Apple's Response",
        "description": "Based on the remarks made by Judge Rogers, Apple will likely lose the antitrust ruling against Epic Games, pending final decision.",
        "publishedAt": "2024-05-13T22:26:38Z",
        "query": "APPLE"
    },
    {
        "title": "iOS 17.5 just launched with a huge security feature for your iPhone",
        "description": "Apple has tried to stop stalking and other ill use cases with AirTags, but has failed against trackers from other brands. iOS 17.5 finally closes that gap.",
        "publishedAt": "2024-05-13T22:19:04Z",
        "query": "APPLE"
    },
    {
        "title": "Evening Report -Courting the Big Apple: Cohen testifies in Trump trial; Mendez’s begins",
        "description": "A quick recap of the day and what to look forward to tomorrow {beacon}    Evening Report   ©  AP Trump’s ex-fixer Michael Cohen takes the stand Michael Cohen, the man who claims to have facilitated a hush money payment of thousands of dollars to a porn actor during the 2016 presidential campaign to keep…",
        "publishedAt": "2024-05-13T22:02:40Z",
        "query": "APPLE"
    },
    {
        "title": "Apple releases iOS 17.5, macOS 14.5, and other updates as new iPads launch",
        "description": "Latest updates launch in the shadow of WWDC keynote on June 10.",
        "publishedAt": "2024-05-13T21:55:20Z",
        "query": "APPLE"
    },
    {
        "title": "AirTags aren't the only trackers you'll get notified about now",
        "description": "Apple and Google are both rolling out software updates that finally add unwanted tracking alerts in iOS and Android for non-AirTag trackers.",
        "publishedAt": "2024-05-13T21:52:00Z",
        "query": "APPLE"
    },
    {
        "title": "NYPD looking for 'person of interest' in random attack on actor Steve Buscemi",
        "description": "Police have identified a person of interest in the random slugging attack on \"Boardwalk Empire\" star Steve Buscemi last week, and are fanning out across the Big Apple looking for the brute.",
        "publishedAt": "2024-05-14T23:30:20Z",
        "query": "APPLE"
    },
    {
        "title": "Samsung matches Apple in customer satisfaction",
        "description": "Samsung is one of the leading smartphone manufacturers in the world, producing millions of units per year. Android Authority reports that the South Korean",
        "publishedAt": "2024-05-14T23:08:19Z",
        "query": "APPLE"
    },
    {
        "title": "I'm building a Windows PC inside an old Apple Mac G5",
        "description": "I'm trying something a little different for my next PC build",
        "publishedAt": "2024-05-14T23:01:19Z",
        "query": "APPLE"
    },
    {
        "title": "NYC shutters 75 illicit weed shops in first week of crackdown, with hundreds and hundreds to go",
        "description": "The first batch of closures mark a drop in the bucket as there are believed to be some 3,000 illegal pot shops operating in the Big Apple, most of which cropped up in the wake of the state legalizing marijuana in 2021 without immediately rolling out a comprehensive legal market.",
        "publishedAt": "2024-05-14T21:29:54Z",
        "query": "APPLE"
    },
    {
        "title": "NYC Transit chief Richard Davey leaving for MassPort: report",
        "description": "New York City Transit President Richard Davey is reportedly fleeing the Big Apple after barely lasting two years in the top job, which sources told The Post left him \"frustrated.\"",
        "publishedAt": "2024-05-14T20:20:10Z",
        "query": "APPLE"
    },
    {
        "title": "Latest Version of Android Has Gemini AI at Its Core",
        "description": "Google today announced several new AI features that it is building into the Android 15 operating system, giving us some insight into what Apple's...",
        "publishedAt": "2024-05-14T20:07:37Z",
        "query": "APPLE"
    },
    {
        "title": "Apple: Preparing For A Future-Defining WWDC",
        "description": "Apple's shareholders expect major announcements at its Worldwide Developers Conference. See why I find AAPL stock slightly overvalued and reiterate as a hold.",
        "publishedAt": "2024-05-14T20:04:43Z",
        "query": "APPLE"
    },
    {
        "title": "Netflix, Peacock and Apple TV Plus streaming bundle announced by Comcast - at ‘vastly reduced price’",
        "description": "Comcast is looking to battle back against Disney and Warner Bros. Discovery with its own streamer bundle that will include Peacock, Netflix and Apple TV+",
        "publishedAt": "2024-05-14T20:03:39Z",
        "query": "APPLE"
    },
    {
        "title": "Apple TV wants to pay actors and producers based on how their content performs",
        "description": "Bloomberg notes that the memo stipulates that if a movie or show is successful, the production staff will receive bonuses. The idea is to use a points...",
        "publishedAt": "2024-05-14T20:03:00Z",
        "query": "APPLE"
    },
    {
        "title": "Foldable iPhone, AR spectacles, new iPhone features and more surface in Apple roadmap",
        "description": "A roadmap for Apple takes us through 2028 and includes a foldable iPhone, a foldable iPad, and AR spectacles.",
        "publishedAt": "2024-05-14T19:58:21Z",
        "query": "APPLE"
    },
    {
        "title": "6 M4 iPad Pro features Apple didn't tell you",
        "description": "With the M4 iPad Pro now available, we discovered hidden features and other secrets Apple kept from us after announcing the tablet.",
        "publishedAt": "2024-05-16T22:41:00Z",
        "query": "APPLE"
    },
    {
        "title": "There’s some Apple UI magic sprinkled into the Pencil Pro experience",
        "description": "Now that the Apple Pencil Pro is in users’ hands, discoveries are being made about the finer details of its design.",
        "publishedAt": "2024-05-16T19:46:38Z",
        "query": "APPLE"
    },
    {
        "title": "iPhone Emulators on the App Store: Game Boy, N64, PS1, PSP, and More",
        "description": "In April, Apple updated its guidelines to allow retro game emulators on the App Store, and several popular emulators have already been released. ...",
        "publishedAt": "2024-05-16T19:45:42Z",
        "query": "APPLE"
    },
    {
        "title": "Coatue Management top Q1 moves: exits Apple, Disney, takes in Qualcomm, piles into TSMC",
        "description": "Coatue Management exited its stakes in Apple (AAPL) and Walt Disney (DIS) in Q1, while taking in a new position in Qualcomm (QCOM). Read more here.",
        "publishedAt": "2024-05-16T18:08:55Z",
        "query": "APPLE"
    },
    {
        "title": "Stop using these default Mac apps — trust me",
        "description": "Not every Mac app created by Apple is a winner. Here are five Apple-designed Mac apps that you should switch out for superior third-party alternatives.",
        "publishedAt": "2024-05-16T17:47:07Z",
        "query": "APPLE"
    },
    {
        "title": "Samsung tries to mock controversial Apple iPad ad, but fails miserably",
        "description": "After Apple's controversial ad for the new M4 iPad Pro, Samsung couldn't resist and created a commercial even worse.",
        "publishedAt": "2024-05-16T16:36:43Z",
        "query": "APPLE"
    },
    {
        "title": "Belkin Memorial Day Sale brings Apple accessory bargains",
        "description": "To bag bargains on great Apple accessories, hit our links to the Belkin Memorial Day Sale. It launched ahead of the holiday this week.",
        "publishedAt": "2024-05-16T16:35:03Z",
        "query": "APPLE"
    },
    {
        "title": "How to play Quartiles in Apple News+",
        "description": "There’s a new daily word game for Apple News+ subscribers called Quartiles. Here's how to play it, plus tips to maximize your score.",
        "publishedAt": "2024-05-16T16:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "AirPods Max Get Rare $99 Discount on Amazon, Available for $449.99",
        "description": "Amazon today has one of the first $99 discounts on Apple's AirPods Max since February, available for $449.99 in four colors, down from...",
        "publishedAt": "2024-05-16T15:52:41Z",
        "query": "APPLE"
    },
    {
        "title": "Samsung Crushes Apple’s Tone Deaf iPad Pro Ad In Hilarious Tweet Retort",
        "description": "Samsung has joined the social media pile-on by making a funny retort to Apple’s Crush Ad.",
        "publishedAt": "2024-05-16T15:45:00Z",
        "query": "APPLE"
    },
    {
        "title": "5 must-watch movies & TV shows streaming right now",
        "description": "Streaming right now: What to watch and the best of what's new on Netflix, Hulu, HBO Max, Disney+, Apple TV+, Peacock, and Paramount+.",
        "publishedAt": "2024-05-17T23:29:51Z",
        "query": "APPLE"
    },
    {
        "title": "iOS 18 is getting a major upgrade that solves a big problem for iPhone users",
        "description": "The Vehicle Motion Cues feature from Apple will help passengers combat motion sickness with overlays that help our eyes understand the direction our bodies are moving.",
        "publishedAt": "2024-05-17T22:08:27Z",
        "query": "APPLE"
    },
    {
        "title": "'iPhone 17 Slim' Could Move Rear Cameras to Top Center in Biggest Redesign Since iPhone X",
        "description": "The Information today reported that Apple plans to release an all-new, high-end iPhone 17 model next year, and there was one detail that is worth...",
        "publishedAt": "2024-05-17T22:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "The Apple TV is coming for the Raspberry Pi’s retro emulation box crown",
        "description": "Apple’s restrictions will still hold it back, but there’s a lot of possibility.",
        "publishedAt": "2024-05-17T21:43:20Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Shares 2023 App Store Transparency Report",
        "description": "Apple today published its second annual App Store Transparency Report [PDF], highlighting details like the number of apps that were rejected during...",
        "publishedAt": "2024-05-17T21:20:47Z",
        "query": "APPLE"
    },
    {
        "title": "When to Expect the Next iPhone SE to Launch",
        "description": "It has been over two years since Apple released the third-generation iPhone SE, and rumors continue to surface about a new model. The latest word...",
        "publishedAt": "2024-05-17T21:03:12Z",
        "query": "APPLE"
    },
    {
        "title": "Super-slim iPhone could be Apple's most expensive ever",
        "description": "Apple reportedly found ways to \"significantly\" slim down the iPhone. The upcoming handset will be for the luxury market, with a high price.",
        "publishedAt": "2024-05-17T20:25:26Z",
        "query": "APPLE"
    },
    {
        "title": "Forget the iPhone 16, this leak reveals Apple's most exciting iPhone in years",
        "description": "Apple is reportedly working on a significantly slimmer iPhone with a major design overhaul, reminiscent of the iPhone X.",
        "publishedAt": "2024-05-17T19:45:25Z",
        "query": "APPLE"
    },
    {
        "title": "You Can Now Play Old-School Nintendo Games on Your Apple TV, iPhone or iPad",
        "description": "Maybe you can finally get Frogger across the road, or beat your buddy at Mario Kart.",
        "publishedAt": "2024-05-17T19:30:00Z",
        "query": "APPLE"
    },
    {
        "title": "11 Apple Watch features you should be using every day",
        "description": "I use my Apple Watch Ultra 2 every day. It has several hidden features that I use to make my life easier. Here they are.",
        "publishedAt": "2024-05-17T19:22:33Z",
        "query": "APPLE"
    },
    {
        "title": "Apple will reportedly offer higher trade-in credit for old iPhones for the next two weeks",
        "description": "According to Bloomberg’s Mark Gurman, Apple will be offering a little more than usual for some trade-ins starting next week in the US and Canada. That's as long as you're getting one of the iPhone 15 models.",
        "publishedAt": "2024-05-18T20:52:40Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Plans to Launch Its Highest-End iPhone 17 Model With a 'Slim' Design, Will Sit Above The 'Pro Max' And Cost Even Higher",
        "description": "Apple is expected to launch a new model in the iPhone 17 lineup with a 'thin' design compared to the rest of the models.",
        "publishedAt": "2024-05-18T20:03:04Z",
        "query": "APPLE"
    },
    {
        "title": "The TV shows dominating Netflix, Apple TV+, Prime Video & more",
        "description": "A closer look at the most-watched shows across the streaming landscape this week, led by Apple TV+'s sci-fi thriller Dark Matter.",
        "publishedAt": "2024-05-18T16:05:00Z",
        "query": "APPLE"
    },
    {
        "title": "iPhone SE 4 to bring back the notch design",
        "description": "Experience the classic Apple design with the iPhone SE 4, resembling the iPhone 14 series. Affordable innovation at your fingertips.",
        "publishedAt": "2024-05-18T14:41:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple will launch the Vision Pro in the UK, Canada, Singapore and other markets",
        "description": "The wait is finally over! Apple's Vision Pro headset is making its way to the UK, Canada, Singapore, and more.",
        "publishedAt": "2024-05-18T14:23:35Z",
        "query": "APPLE"
    },
    {
        "title": "iFixit Shares 13-Inch iPad Pro and Apple Pencil Pro Teardown Video",
        "description": "The popular repair website iFixit today shared a video with teardowns of the new 13-inch iPad Pro and the Apple Pencil Pro. The website praised the...",
        "publishedAt": "2024-05-18T13:31:48Z",
        "query": "APPLE"
    },
    {
        "title": "Top Stories: New iPads Launch, Apple Previews iOS 18 Accessibility Features, and More",
        "description": "The new iPads are here! Following their unveiling at last week's \"Let Loose\" Apple event, the new iPad Pro and iPad Air models launched...",
        "publishedAt": "2024-05-18T13:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "Which Of Apple’s 2024 iPad Pro And iPad Air Models Are Currently Discounted On Amazon?",
        "description": "Want to get Apple’s 2024 iPad Pro or iPad Air models at a discount? We have a list prepared as to which tablets are cheaper right now",
        "publishedAt": "2024-05-18T10:28:25Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Prepares to Launch Vision Pro in UK, Canada, and Other Countries",
        "description": "Apple will soon begin selling the Vision Pro in additional markets outside the U.S., according to Bloomberg, and Mark Gurman today reports that the...",
        "publishedAt": "2024-05-18T08:35:08Z",
        "query": "APPLE"
    },
    {
        "title": "Apple M4 vs Apple M3 - How Do the Two Apple Silicones Compare?",
        "description": "Unleash the true potential of your device with the Apple M4 processor. Compare it to the M3 and witness the evolution of Apple's chip.",
        "publishedAt": "2024-05-18T08:34:30Z",
        "query": "APPLE"
    },
    {
        "title": "iPhone 15 Pro gets a discount of over $300 for a limited time",
        "description": "Get ready for jaw-dropping discounts on Apple's iPhone 15 Pro in China. Don't miss out on this limited-time offer",
        "publishedAt": "2024-05-19T18:49:30Z",
        "query": "APPLE"
    },
    {
        "title": "iOS 18 to Use AI to Summarize Notifications, Add to Calendar, and More",
        "description": "Apple is poised to unveil an auto-summarization feature for notifications as part of a series of new artificial intelligence features in iOS 18,...",
        "publishedAt": "2024-05-19T18:37:35Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Music's Ranking Of Nas' \"Illmatic\" On Their Top 100 Albums List Has Fans Outraged",
        "description": "Apple Music began the 10-day countdown of ranking the top 100 albums ever and Nas' \"Illmatic\" had a questionable ranking, to say the least.",
        "publishedAt": "2024-05-19T18:30:17Z",
        "query": "APPLE"
    },
    {
        "title": "iPhone 16 Lineup Rumored to Come in These Two New Colors",
        "description": "Apple analyst Ming-Chi Kuo today outlined his expectations for the iPhone 16 lineup's color options, revealing that two new colors should replace...",
        "publishedAt": "2024-05-19T18:08:52Z",
        "query": "APPLE"
    },
    {
        "title": "42nd Annual Apple Multisport Festival Offers Unique Opportunity",
        "description": "Sunday was a great day to run, bike, and swim in Sartell. The 42nd Annual Apple Multisport Festival took place at the Sartell-St. Stephen High School.",
        "publishedAt": "2024-05-19T16:28:04Z",
        "query": "APPLE"
    },
    {
        "title": "Apple is making a mistake by holding the iPad Pro back",
        "description": "Apple says most Mac owners also have an iPad, but that shouldn't keep the M4 iPad Pro from being a Mac alternative.",
        "publishedAt": "2024-05-19T16:06:00Z",
        "query": "APPLE"
    },
    {
        "title": "A thinner, more expensive iPhone may be joining Apple's lineup",
        "description": "Apple is working on a slimmed down version of the iPhone, according to a report in The Information, which cited three people that have direct knowledge of...",
        "publishedAt": "2024-05-19T14:41:00Z",
        "query": "APPLE"
    },
    {
        "title": "Siri could get a more conversational voice in iOS 18",
        "description": "Siri could get a lot smarter and useful in iOS 18, with Apple reportedly working on adding \"proactive intelligence\" features to it.",
        "publishedAt": "2024-05-19T13:40:26Z",
        "query": "APPLE"
    },
    {
        "title": "AirTag With New Chip and Improved Location Tracking Due Next Year",
        "description": "Apple's next-generation AirTag item tracker is on track to launch in mid-2025, Bloomberg's Mark Gurman reports. In his latest \"Power...",
        "publishedAt": "2024-05-19T12:28:40Z",
        "query": "APPLE"
    },
    {
        "title": "This iPhone Setting Will Make It Easy To Switch Between Pages On Safari",
        "description": "Safari, Apple's default web browser, may seem like a boring alternative to Google's Chrome. But it has some fun features specially built for the iPhone.",
        "publishedAt": "2024-05-20T22:15:02Z",
        "query": "APPLE"
    },
    {
        "title": "The New Surface Is Impressive, But It's Not an Apple Killer",
        "description": "Microsoft emphasized how the Surface compared to the MacBook Air, equipped with the M3, but the M4 is on the horizon.",
        "publishedAt": "2024-05-20T22:06:10Z",
        "query": "APPLE"
    },
    {
        "title": "Best Memorial Day smartwatch deals: Garmin, Apple Watch & more",
        "description": "These early Memorial Day sales are perfect for those looking to pick up a new smartwatch.",
        "publishedAt": "2024-05-20T22:00:58Z",
        "query": "APPLE"
    },
    {
        "title": "iPad Pro M4 Review (2024): More Power Than You'll Need, Less Than You Want",
        "description": "The newest iPad Pro for 2024 takes power up another significant notch while it delivers the thinnest Apple device yet.",
        "publishedAt": "2024-05-20T21:28:39Z",
        "query": "APPLE"
    },
    {
        "title": "New Arm-powered Surface Pro and Surface Laptop aim directly at Apple Silicon Macs",
        "description": "Microsoft's first \"Copilot+ PCs\" aim for the MacBook Air; neither is fanless.",
        "publishedAt": "2024-05-20T21:09:07Z",
        "query": "APPLE"
    },
    {
        "title": "Microsoft's Copilot+ PCs Are a Full Court Press Against Apple",
        "description": "There’s tons of new Snapdragon X Elite-powered PCs, plus a new Surface Pro 2-in-1 that wants to be your everything device for supercharged AI.",
        "publishedAt": "2024-05-20T21:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Just Raised the Trade-in Value for Your iPhone",
        "description": "Apple wants you to upgrade your old iPhone and is willing to give you a bit more trade-in credit to convince you to do so. Until June 3, the Apple Store (both online and physical locations) is offering more money in trade-in value for your old iPhone when you trade it in for a newer iPhone.",
        "publishedAt": "2024-05-20T20:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "iPhone 16 series to add new colours but ditches the blue & yellow colours",
        "description": "Explore Apple's iPhone 16 series with fresh colors and a return to vertical camera design. Find out more here",
        "publishedAt": "2024-05-20T19:17:53Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Previewed the Future of the iPad and Nobody Noticed",
        "description": "Apple’s new M4 iPad Pros and M2 iPad Airs are sleek and powerful, but still just tablets for most people. But a new eye tracking accessibility feature Apple showed off for Global Accessibility Awareness Day shows how iPads could get a major reboot with Vision Pro-esque eye and hand-tracked controls.",
        "publishedAt": "2024-05-20T19:00:25Z",
        "query": "APPLE"
    },
    {
        "title": "We finally know when Apple may release a second-gen AirTag",
        "description": "We've finally gotten some concrete information about the second-generation Apple AirTag. Here's what might be new.",
        "publishedAt": "2024-05-20T18:57:01Z",
        "query": "APPLE"
    },
    {
        "title": "Next Emoji Coming to iOS Could Include Face With Eye Bags, Shovel, Fingerprint, Splatter and More",
        "description": "Apple adds new emoji to the iPhone, iPad, Mac, and other devices regularly based on updates made to the emoji catalog by the Unicode Consortium, and...",
        "publishedAt": "2024-05-21T23:13:35Z",
        "query": "APPLE"
    },
    {
        "title": "Apple patents a foldable iPhone with ‘self-healing’ screen",
        "description": "The patent doesn’t describe what Apple would use for its self-healing layer other than “a polymer or any other desired material having self-healing properties.”",
        "publishedAt": "2024-05-21T22:06:23Z",
        "query": "APPLE"
    },
    {
        "title": "iOS 18 Apple Music App to Get Smarter Song Transitions",
        "description": "With iOS 18 and macOS 15, the Apple Music app will gain smarter song transitions, reports AppleInsider. Apple is reportedly testing a new feature...",
        "publishedAt": "2024-05-21T21:05:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple patents foldable iPhone featuring a 'self-healing screen'",
        "description": "Apple has quietly patented a foldable \"self-healing screen.\" Could a foldable iPhone be far behind?",
        "publishedAt": "2024-05-21T21:00:32Z",
        "query": "APPLE"
    },
    {
        "title": "New 'Parkour' Immersive Video Coming to Vision Pro on Friday",
        "description": "Apple is set to release a new immersive video on the Vision Pro on Friday, with \"Parkour\" labeled as episode two in the \"Adventure\"...",
        "publishedAt": "2024-05-21T19:48:42Z",
        "query": "APPLE"
    },
    {
        "title": "Netflix, Peacock, and Apple TV+ Form a Streaming Bundle",
        "description": "Comcast introduces a new streaming service bundle: Netflix, Peacock, and Apple TV+. The catch? Well, you have to be an Xfinity customer to get their deal.",
        "publishedAt": "2024-05-21T18:55:26Z",
        "query": "APPLE"
    },
    {
        "title": "Why Apple should steal Microsoft's Flex keyboard design for iPad",
        "description": "Come along as we explore the idea of a wired and wireless iPad Magic Keyboard. Find out why it would enhance the functionality of the iPad.",
        "publishedAt": "2024-05-21T18:32:24Z",
        "query": "APPLE"
    },
    {
        "title": "Apple asks NJ court to toss DOJ antitrust lawsuit",
        "description": "Apple (AAPL) has sent a letter to a New Jersey judge overseeing its antitrust lawsuit from the Department of Justice to throw out the case. Read for more.",
        "publishedAt": "2024-05-21T18:01:28Z",
        "query": "APPLE"
    },
    {
        "title": "Hurry! Apple's boosting iPhone trade-in values for a limited time",
        "description": "If you trade-in your iPhone at Apple by June 3, you could get a bigger return than normal, as the company is increasing the size of the rebates it's offering for a limited time.",
        "publishedAt": "2024-05-21T17:55:27Z",
        "query": "APPLE"
    },
    {
        "title": "Xiaomi copies Apple's controversial iPad promo days after Samsung mocked it",
        "description": "This time cinema gear goes in the press",
        "publishedAt": "2024-05-21T17:49:41Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Releases Safari Technology Preview 195 With Bug Fixes and Performance Improvements",
        "description": "Apple today released a new update for Safari Technology Preview, the experimental browser Apple first introduced in March 2016. Apple designed the...",
        "publishedAt": "2024-05-23T23:07:02Z",
        "query": "APPLE"
    },
    {
        "title": "Flappy Bird Marks Its 11th Year Anniversary When It Launched On Apple’s App Store Today And Took The Mobile Gaming World By Storm",
        "description": "The iconic Flappy Bird launched today 11 years ago for the Apple App Store, so we take a trip down memory lane regarding this famous game",
        "publishedAt": "2024-05-23T22:39:49Z",
        "query": "APPLE"
    },
    {
        "title": "Memorial Day laptop sales - 11 epic deals I recommend",
        "description": "We've rounded up the best Memorial Day laptop sales, including disconts on Apple, Dell, HP, ASUS, and more.",
        "publishedAt": "2024-05-23T22:28:30Z",
        "query": "APPLE"
    },
    {
        "title": "Find EV charging stations in Apple Maps",
        "description": "Apple Maps helps you find EV charging stations while you’re on the road. It shows charger availability, charging speed and connector types.",
        "publishedAt": "2024-05-23T22:00:09Z",
        "query": "APPLE"
    },
    {
        "title": "While it may never happen, I would love to see Apple release a standalone Arm CPU",
        "description": "It would be a strange shake-up for the CPU market.",
        "publishedAt": "2024-05-23T21:00:14Z",
        "query": "APPLE"
    },
    {
        "title": "macOS 15 System Settings to Get Design Overhaul",
        "description": "With the macOS 15 update that is set to debut at WWDC in June, Apple plans to rearrange \"menus and app UIs,\" according to a report from...",
        "publishedAt": "2024-05-23T19:51:30Z",
        "query": "APPLE"
    },
    {
        "title": "Japan plans to follow the EU's lead and force Apple to open its App Store",
        "description": "Japan targets Apple's App Store with new law to enhance competition and lower app prices, mirroring the EU’s Digital Markets Act.",
        "publishedAt": "2024-05-23T19:24:13Z",
        "query": "APPLE"
    },
    {
        "title": "Welcome to the Ultra era with luxury iPhones, Macs, and iPads",
        "description": "Apple seems set on reaching new high starting prices with its products, as exemplified by recent moves and reports of what’s still to come.",
        "publishedAt": "2024-05-23T19:13:38Z",
        "query": "APPLE"
    },
    {
        "title": "Apple's Foldable MacBooks, Featuring 18-Inch And 20-Inch Displays Supplied By LG, Are Set To Launch By The End Of 2025",
        "description": "Apple is expected to launch its foldable MacBook models by the end of 2025 in 18.8-inch and 20.2-inch screen sizes, with LG as the supplier.",
        "publishedAt": "2024-05-23T18:38:51Z",
        "query": "APPLE"
    },
    {
        "title": "Top 10 best-selling smartphones globally in Q1 2024",
        "description": "Discover which smartphones dominated Q1 2024! See the top 10 best-sellers from Apple and Samsung in our latest article.",
        "publishedAt": "2024-05-23T18:30:32Z",
        "query": "APPLE"
    },
    {
        "title": "Shop Memorial Day sales on Amazon for deals on celeb-loved beauty, more",
        "description": "Amazon's 2024 Memorial Day sale offers markdowns up to 40% off celebrity-loved beauty products, fashion finds, home decor and more from the likes of Apple and Dyson.",
        "publishedAt": "2024-05-24T19:31:00Z",
        "query": "APPLE"
    },
    {
        "title": "How to sell your old Apple Pencil or Magic Keyboard",
        "description": "The Cult of Mac buyback program is a great place to sell your Apple Pencil or Magic Keyboard for iPad Pro when it's time to upgrade.",
        "publishedAt": "2024-05-24T18:57:14Z",
        "query": "APPLE"
    },
    {
        "title": "5 must-watch movies & TV shows streaming right now",
        "description": "Streaming right now: What to watch and the best of what's new on Netflix, Hulu, HBO Max, Disney+, Apple TV+, Peacock, and Paramount+.",
        "publishedAt": "2024-05-24T18:55:13Z",
        "query": "APPLE"
    },
    {
        "title": "Apple set to phase out LCD - OLED panels for iPad mini are on its way",
        "description": "Apple is planning a major upgrade for the iPad Mini, transitioning to OLED screens by 2026 for improved display quality.",
        "publishedAt": "2024-05-24T18:39:29Z",
        "query": "APPLE"
    },
    {
        "title": "Here's Why Your iPhone's Deleted Photos Came Back",
        "description": "Apple found itself dealing with a pretty huge bug when iOS 17.5 caused deleted photos to resurface on users' devices. Now, the company has finally spoken out about the possible causes behind the issue.",
        "publishedAt": "2024-05-24T18:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "Best Apple Deals of the Week: iPads and Apple Watches See Record Low Prices Alongside Samsung Monitors",
        "description": "This week began with a sitewide sale on Samsung that will end this Sunday, and continued with great discounts on the M4 iPad Pro, 10th generation...",
        "publishedAt": "2024-05-24T17:23:13Z",
        "query": "APPLE"
    },
    {
        "title": "Better and way cheaper than iPads",
        "description": "If you're not locked into Apple's ecosystem, check out the Amazon Fire 11 Max Tablet instead of an iPad. It's bigger, better, and cheaper.",
        "publishedAt": "2024-05-24T16:28:22Z",
        "query": "APPLE"
    },
    {
        "title": "The 7 best new movies and shows to stream this weekend",
        "description": "What to watch on Netflix, Disney Plus, Hulu, Apple TV Plus, Max, and Paramount Plus this weekend",
        "publishedAt": "2024-05-24T16:27:21Z",
        "query": "APPLE"
    },
    {
        "title": "MacRumors Giveaway: Win a New M2 iPad Air, Apple Pencil Pro and Rock Paper Pencil Kit From Astropad",
        "description": "For this week's giveaway, we've teamed up with Astropad to offer MacRumors readers a chance to win one of Apple's new M2 iPad Air models,...",
        "publishedAt": "2024-05-24T16:02:00Z",
        "query": "APPLE"
    },
    {
        "title": "All The Best Memorial Day Deals At Amazon",
        "description": "Kick off summer with up to 58% off Columbia hiking boots, an Apple iPad Air, an Instant Pot, and more.",
        "publishedAt": "2024-05-24T15:51:04Z",
        "query": "APPLE"
    },
    {
        "title": "47+ best Amazon Memorial Day sales 2024",
        "description": "Shop the best Amazon Memorial Day from brands like Dyson, Hydro Flask, Apple and Revlon.",
        "publishedAt": "2024-05-25T22:55:05Z",
        "query": "APPLE"
    },
    {
        "title": "shop bedding, home goods and more",
        "description": "Shop the best Memorial Day deals across categories like mattresses, bedding, tech and more from brands like Brooklinen, Supergoop, Apple and Our Place.",
        "publishedAt": "2024-05-25T22:54:50Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Watch Ultra 3: All the rumors you need to know",
        "description": "All signs pointed to a new Apple Watch 3 device launching imminently, but it failed to make an appearance at Monday's Glowtime event. Here's everything we know about specs, price and features whenever Apple does announce it.",
        "publishedAt": "2024-05-25T18:27:35Z",
        "query": "APPLE"
    },
    {
        "title": "Foxconn suicides spark Apple probe",
        "description": "On May 25, 2010, Apple opened an investigation into a string of suicides at Foxconn, its Chinese partner for manufacturing iPhones.",
        "publishedAt": "2024-05-25T16:25:20Z",
        "query": "APPLE"
    },
    {
        "title": "The biggest TV shows dominating all the major streamers right now",
        "description": "A closer look at the 10 most-watched TV shows this week from Netflix, Apple TV+, Prime Video, and more, courtesy of Reelgood.",
        "publishedAt": "2024-05-25T16:05:00Z",
        "query": "APPLE"
    },
    {
        "title": "Here's why iOS restored deleted photos, and why Android's at risk too",
        "description": "Apple was the one to get bitten by it, but the underlying problem lies with flash storage",
        "publishedAt": "2024-05-25T16:00:12Z",
        "query": "APPLE"
    },
    {
        "title": "We Review Best Cleaning Kit for Apple Earbuds",
        "description": "The Keybudz Air Care 2.0. AirPods Cleaning Kit comes with everything you need to refresh your earbuds, so they look -- and sound -- clean and crisp.",
        "publishedAt": "2024-05-25T15:40:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple 13-Inch M2 iPad Air Teardown Reveals DIY Repairs Are Tricky",
        "description": "Apple has never designed its iPad devices in a way that truly facilities DIY repairs, and that hasn't changed with the iPad Air 6.",
        "publishedAt": "2024-05-25T15:00:00Z",
        "query": "APPLE"
    },
    {
        "title": "The Best Memorial Day Apple Deals From Amazon, Anker, and More",
        "description": "It's Memorial Day weekend, and retailers across the Internet are hosting a wide variety of discount events to honor the holiday and celebrate the...",
        "publishedAt": "2024-05-25T14:36:23Z",
        "query": "APPLE"
    },
    {
        "title": "Memorial Day deals on Apple gear: Find them with our guide",
        "description": "When Memorial Day weekend rolls around, you know great deals on Apple gear and accessories are out there. We'll help you find them.",
        "publishedAt": "2024-05-25T13:30:53Z",
        "query": "APPLE"
    },
    {
        "title": "Surface Pro 11 vs MacBook Air: Can Microsoft Copilot+ unseat Apple?",
        "description": "The new Surface Pro 11 is seriously impressive, but is it worth considering over a laptop like the MacBook Air M3? Let's take a look.",
        "publishedAt": "2024-05-27T17:30:13Z",
        "query": "APPLE"
    },
    {
        "title": "The buckets of AI and where Nvidia is crushing it",
        "description": "We have had a lot of AI news lately – product launches from OpenAI, Google, and Microsoft. Now we are just waiting for Apple and its upcoming...",
        "publishedAt": "2024-05-27T16:36:11Z",
        "query": "APPLE"
    },
    {
        "title": "Apple considers two large touchscreen sizes for MacBook [Updated]",
        "description": "Apple's folding MacBook could come with a huge or a gigantic touchscreen. But the all-screen design won't have a visible crease.",
        "publishedAt": "2024-05-27T15:33:47Z",
        "query": "APPLE"
    },
    {
        "title": "My Favorite Memorial Day Sales on Tablets",
        "description": "Today is Memorial Day, and many retailers have been offering deals on laptops, TVs, headphones, Bluetooth speakers, smartphones, and tablets. If you want a new tablet, consider these deals on Apple, Samsung, and Amazon Fire devices.",
        "publishedAt": "2024-05-27T15:03:36Z",
        "query": "APPLE"
    },
    {
        "title": "My Favorite Memorial Day Sales on Headphones and Earbuds",
        "description": "It's a good time to get a new pair of earbuds or headphones, with retailers like Amazon and Woot slashing prices on many headphone and earbud brands for Memorial Day. You can find discounts of up to 55% on Beats, Samsung, Shokz, Apple, Skullcandy, Sony and other brands.",
        "publishedAt": "2024-05-27T14:46:24Z",
        "query": "APPLE"
    },
    {
        "title": "Memorial Day deals: $189 AirPods Pro, $43 camera drone, $179 Roomba, Crest 3D Whitestrips, Instant Pot, more",
        "description": "Our picks for the best Memorial Day deals include Apple AirPods Pro, camera drones, Roomba vacuums, Crest 3D Whitestrips, and more.",
        "publishedAt": "2024-05-27T14:13:00Z",
        "query": "APPLE"
    },
    {
        "title": "The 57+ best Amazon Memorial Day 2024 deals to shop now",
        "description": "Shop the best Amazon Memorial Day from brands like Dyson, Hydro Flask, Apple and Revlon.",
        "publishedAt": "2024-05-27T14:03:54Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Offers Surprise iPhone 14 Pro Deals With Up To 1TB Of Storage",
        "description": "These are certified refurbished devices that come direct from Apple with a new battery, new outer shell, all original accessories, and a 1-year warranty.",
        "publishedAt": "2024-05-27T13:47:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Says Future iPads Could Feature Landscape Apple Logo",
        "description": "French website Numerama interviewed three senior Apple employees about the new iPad Pro models that launched earlier this month. While the discussion...",
        "publishedAt": "2024-05-27T13:31:32Z",
        "query": "APPLE"
    },
    {
        "title": "Get a sturdy 3-foot charging cable for just $7.99",
        "description": "Tired of fraying Apple cables you can't depend on? The 3-foot Avanta USB-A to USB-C cable is sturdy, inexpensive and reliable.",
        "publishedAt": "2024-05-27T13:30:52Z",
        "query": "APPLE"
    },
    {
        "title": "YouTube’s Playables doesn’t have the games to compete with Apple",
        "description": "The free games on YouTube mobile recalls AddictingGames.com and Facebook Games, but it isn’t giving Apple Arcade or App store a run for its money.",
        "publishedAt": "2024-05-28T21:24:05Z",
        "query": "APPLE"
    },
    {
        "title": "Apple’s WWDC opportunity: how iOS 18 can make AI mainstream",
        "description": "Apple has a unique opportunity with iOS 18 to take AI features to the masses in a way that hasn‘t happened quite yet.",
        "publishedAt": "2024-05-28T20:00:12Z",
        "query": "APPLE"
    },
    {
        "title": "NYC students are asked to participate in remote-learning simulation — on their day off",
        "description": "Big Apple families are being guilt-tripped by the city into joining a remote-learning simulation on their kids' day off to better prepare for an emergency after a technical meltdown during a February snow day.",
        "publishedAt": "2024-05-28T19:56:40Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Releases New AirPods Pro 2 Firmware",
        "description": "Apple today released new firmware update for both the Lightning and USB-C versions of the AirPods Pro 2. The new firmware is version 6F7, up from the...",
        "publishedAt": "2024-05-28T19:56:23Z",
        "query": "APPLE"
    },
    {
        "title": "Ever dream of a LEGO Apple Store? This fan built one",
        "description": "A fan and expert LEGO builder has created a LEGO Apple Store set, which they hope to see become an official licensed product one day.",
        "publishedAt": "2024-05-28T19:25:49Z",
        "query": "APPLE"
    },
    {
        "title": "VR classics Job Simulator and Vacation Simulator come to Apple Vision Pro",
        "description": "Job Simulator and Vacation Simulator have been released for the Apple Vision Pro. This is a version developed specifically for the platform with optimized hand-and-eye tracking.",
        "publishedAt": "2024-05-28T19:05:45Z",
        "query": "APPLE"
    },
    {
        "title": "Apple’s AI plans for the iPhone just leaked. Here’s what we know",
        "description": "At its annual developers conference next month, Apple will reportedly introduced AI-fueled versions of Siri and Spotlight, alongside enhancements for apps.",
        "publishedAt": "2024-05-28T18:42:35Z",
        "query": "APPLE"
    },
    {
        "title": "5 rumored iOS 18 features I'm most excited about - and AI is just the start",
        "description": "Will Apple finally enable full home screen customization? These are the rumored features I'm most looking forward to seeing revealed at next month's WWDC.",
        "publishedAt": "2024-05-28T18:34:00Z",
        "query": "APPLE"
    },
    {
        "title": "Next Apple Watch Activity Challenge to Take Place on June 5 to Celebrate Global Running Day",
        "description": "Apple is planning a new Apple Watch activity challenge for June 5, which is Global Running Day. This is an Apple Watch activity challenge that Apple...",
        "publishedAt": "2024-05-28T18:32:13Z",
        "query": "APPLE"
    },
    {
        "title": "Apple To ‘Highly Likely’ Add OLED Technology To Its MacBook Pro Line As Early As 2026, Resulting In A Major Demand Surge In The Coming Years",
        "description": "New MacBook Pro models arriving in 2026 are expected to feature OLED technology, resulting in an increase in shipments",
        "publishedAt": "2024-05-28T18:22:11Z",
        "query": "APPLE"
    },
    {
        "title": "Cramer explains why Nvidia's ballooning market cap has its skeptics",
        "description": "If Nvidia keeps up its current growth pace, Cramer said it could soar past Apple and overtake Microsoft soon.",
        "publishedAt": "2024-05-29T22:47:08Z",
        "query": "APPLE"
    },
    {
        "title": "This might be a hint that Apple TV+ isn't done with Ted Lasso yet",
        "description": "Is more Ted Lasso possibly in the works? Maybe as a spinoff? One actor's tweet has us feeling hopeful.",
        "publishedAt": "2024-05-29T22:43:00Z",
        "query": "APPLE"
    },
    {
        "title": "Apple TV Plus is finally coming to Android according to new report",
        "description": "A new job listing from Apple looking for an Android engineer indicates Apple is building an Apple TV+ app",
        "publishedAt": "2024-05-29T22:21:10Z",
        "query": "APPLE"
    },
    {
        "title": "Apple TV Plus Could Be Coming To Android Devices",
        "description": "It appears that Apple TV Plus could be coming to Android devices soon. Bloomberg reports that the tech giant is seeking an Android engineer who will help",
        "publishedAt": "2024-05-29T21:57:50Z",
        "query": "APPLE"
    },
    {
        "title": "Apple TV+ could finally be coming to Android",
        "description": "Apple TV app on Android could be a reality soon",
        "publishedAt": "2024-05-29T21:35:42Z",
        "query": "APPLE"
    },
    {
        "title": "Function101 BentoStack holds 10 Apple accessories",
        "description": "If space is at a premium and you can't compromise safety, try Function101's BentoStack to organize your tech accessories.",
        "publishedAt": "2024-05-29T21:30:59Z",
        "query": "APPLE"
    },
    {
        "title": "iOS 18 Rumor Recap: Over 20 New Features to Expect as WWDC Nears",
        "description": "iOS 18 is just around the corner, with Apple set to unveil the software update during its WWDC keynote next month. Below, we recap new features and...",
        "publishedAt": "2024-05-29T21:04:38Z",
        "query": "APPLE"
    },
    {
        "title": "Apple TV app is coming to Android, job listing reveals",
        "description": "Apple posted a job listing in search of an Android software engineer for the Apple TV app after years of avoiding the platform.",
        "publishedAt": "2024-05-29T20:57:00Z",
        "query": "APPLE"
    },
    {
        "title": "Did hell freeze over? Apple looks to build TV and sports app for Android.",
        "description": "A report says Apple seeks a senior engineer to build a TV and sports app for Android -- Android! -- in its quest for streaming market share.",
        "publishedAt": "2024-05-29T20:48:25Z",
        "query": "APPLE"
    },
    {
        "title": "StreamSaver bundles Apple TV+, Netflix and Peacock for $15",
        "description": "Combine Apple TV+, Netflix, and Peacock at 35% off. Discover the just-launched StreamSaver streaming bundle option for cordcutters.",
        "publishedAt": "2024-05-29T20:03:37Z",
        "query": "APPLE"
    },
    {
        "title": "Popular Apple And Beelink Mini PCs Are Even More Budget-Friendly Than Usual At Amazon",
        "description": "Outfit your home office with a compact mini PC.",
        "publishedAt": "2024-05-31T23:01:57Z",
        "query": "APPLE"
    },
    {
        "title": "Start a smart apartment for cheap with these 7 Amazon deals from $7",
        "description": "Just because you live in an apartment doesn't mean you can't benefit from smart home upgrades. Amazon's latest smart home device sale can help you control your place using the Alexa, Apple, Google, and Matter platforms.",
        "publishedAt": "2024-05-31T21:51:26Z",
        "query": "APPLE"
    },
    {
        "title": "5 must-watch movies & TV shows streaming right now",
        "description": "Streaming right now: What to watch and the best of what's new on Netflix, Hulu, HBO Max, Disney+, Apple TV+, Peacock, and Paramount+.",
        "publishedAt": "2024-05-31T21:28:47Z",
        "query": "APPLE"
    },
    {
        "title": "Topping Apple, Samsung is your global smartphone leader for Q1 2024",
        "description": "Samsung was the leading smartphone manufacturer worldwide during the first quarter.",
        "publishedAt": "2024-05-31T19:40:58Z",
        "query": "APPLE"
    },
    {
        "title": "7 Useful Ways Apple Is Planning to Fix Siri With AI",
        "description": "With the upcoming iOS 18 update, Apple will reportedly upgrade its Siri voice assistant with AI and large language models to perform tasks on an iPhone user's behalf, like generating summaries for Apple News articles, organizing Apple Notes, and even sending and deleting emails for you.",
        "publishedAt": "2024-05-31T18:00:25Z",
        "query": "APPLE"
    },
    {
        "title": "Best Apple Deals of the Week: Record Low Prices Hit 10th Gen iPad and M2 iPad Air, Plus Sonos and Anker Discounts",
        "description": "Some of the best deals of the last week included steep markdowns on Apple-related accessories from companies like Sonos and Anker, but you'll...",
        "publishedAt": "2024-05-31T16:34:39Z",
        "query": "APPLE"
    },
    {
        "title": "Exclusive: iOS 18 to Add Text Effects to iMessage",
        "description": "Apple plans to add a new text effects feature to the Messages app on iOS 18, according to multiple sources familiar with the matter. While it is...",
        "publishedAt": "2024-05-31T16:17:47Z",
        "query": "APPLE"
    },
    {
        "title": "Marvel's \"What If...?\" for Apple Vision Pro looks incredible, but plays terribly",
        "description": "Marvel's What If...? is an intriguing experiment for the Apple Vision Pro, but it plays terribly.",
        "publishedAt": "2024-05-31T14:30:28Z",
        "query": "APPLE"
    },
    {
        "title": "Apple Vision Pro International Launch Likely Scheduled for July",
        "description": "The international launch of Apple's Vision Pro headset could finally occur in July, just over six months after the device was released in the...",
        "publishedAt": "2024-05-31T13:53:10Z",
        "query": "APPLE"
    },
    {
        "title": "Your iPhone gets a choice: First alternative to Apple Wallet ready to arrive in Europe",
        "description": "British company Curve claims it is good to go and launch its competing Wallet app right away.",
        "publishedAt": "2024-05-31T13:38:32Z",
        "query": "APPLE"
    }
]